
// ======================================================== start =====================================================

// Задача 1: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.

// 456 -> 5
// 782 -> 8
// 918 -> 1

/*
int randomNum = new Random().Next(100, 1000);
int CheckSecondNumber(int num)
{
    int dec = num / 10;
    int res = dec % 10;
    return res;
}

int result = CheckSecondNumber(randomNum);
Console.WriteLine($"рандомное число = {randomNum}");
Console.WriteLine($"второй цифр = {result}");
*/

// ======================================================== end =====================================================


// ======================================================== start =====================================================

// Задача 2: Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.

// 645 -> 5
// 78 -> третьей цифры нет
// 32679 -> 6
/*
Console.WriteLine("Введите число");
int a = Convert.ToInt32(Console.ReadLine());

bool TripleDigits(int number){
    if(number/100!=0){
        return true;
    }else{
        return false;
    }
}
bool res = TripleDigits(a);
if(res){
    while(a>=1000){
        int dif=a/10;
        a=dif;
    }
    int result=a%10;
    Console.WriteLine($"третья цифра = {result}");
}
else{
     Console.WriteLine("третьей цифры нет");
}
*/
// ======================================================== end =====================================================

// ======================================================== start =====================================================

// Задача 2: Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.

// 6 -> да
// 7 -> да
// 1 -> нет

Console.Write("Введите день недели: ");
int weekDay=Convert.ToInt32(Console.ReadLine());

void WeekDays(int num){
    if(num==1 || num==2 ||num==3|| num==4||num==5){
        Console.WriteLine("день недели");
    }
    if(num==6 ||num ==7){
        Console.WriteLine("Выходной день");
    }
    if(num>=8 || num==0){
        Console.WriteLine("моя твоя не понимает");
    }
}
WeekDays(weekDay);

// ======================================================== end =====================================================